#include<iostream>
#include <math.h>										//для ceil()
using namespace std;


int main()
{
//Вася работает программистом и получает 50$ за каждые 100 строк кода.
//За каждое третее опоздание Васю штрафуют на 20$.
//Реализовать меню :
//- пользователь вводит желаемый доход Васи и количество опозданий, посчитать, сколько строк кода ему надо написать
//- пользователь вводит количество строк кода, написанное Васей и желаемый объем зарплаты.Посчитать, сколько раз Вася может опоздать
//- пользователь вводит количество строк кода и количество опозданий, определить, сколько денег заплатят Васе и заплатят ли вообще.
	setlocale(LC_ALL, "RUS");

	int menu, salary, lines, late;						//змiннi

														//Меню
	cout << "1 - Ввести бажану з/п i кiлькiсть запiзнень\n2 - Ввести кiлькiсть рядкiв коду i бажану з/п\n3 - Ввести кiлькiсть рядкiв коду i кiлькiсть запiзнень\n4 - Вихiд\n";
	cin >> menu;

	switch (menu)
	{
	case 1:
	{
		cout << "Введiть бажану з/п ";
		cin >> salary;
		cout << "Введiть кiлькiсть запiзнень ";
		cin >> late;
		cout << "\nКiлькiсть штрафiв - " << late / 3 << ". В сумi на "<< late/3*20 << "$" << endl;
		lines = ceil(((float)salary+((late/3)*20))/50)*100;
		cout << "Васi потрiбно написати " << lines << " рядкiв коду.\nПобажаємо йому удачi." << endl;
		break;
	}
	case 2:
	{
		cout << "Введiть бажану з/п ";
		cin >> salary;
		cout << "Введiть кiлькiсть рядкiв коду ";
		cin >> lines;
		if (((lines / 100) * 50 - salary) < 0)
			cout << "\nЗ таким кодiнгом Вася не отримає бажаної зарплати.\nА буде запiзнюватись то ще i винним залишишся.\n" << endl;
		else
		{
			late = ((lines / 100) * 50 - salary) / 20 * 3;
			cout << "\nВася накодив на " << lines / 100 * 50 << " $.\nА це дозволяє йому запiзнитись "<< late << " рази(iв)\n" << endl;			
		}
		break;
	}
	case 3:
	{
		cout << "Введiть кiлькiсть рядкiв коду ";
		cin >> lines;
		cout << "Введiть кiлькiсть запiзнень ";
		cin >> late;
		salary = (lines / 100) * 50 - (late / 3) * 20;
		if (salary < 0)
			cout << "\nВася погано кодив.\nВася лишився винним " << salary << " $\nНе будь як Вася\n\n";
		else if (!salary)
			cout << "\nВася погано кодив.\nВася лишився без зарплати.\n\n";
		else
			cout << "\nВася накодив на " << lines / 100 * 50 << "$\n" << "За " << late << " запiзнень(ня) з нього вирахують " << (late / 3) * 20 << "$\n" << "У Васi залишиться " << salary << "$\n\n";
		break;
	}
	case 4:cout << "Вихiд\n\n"; exit(0);
	default:cout << "Некоректний ввiд\n\n"; break;
	}

	system("pause");
	return 0;
}